program mego_kill;
  uses graphABC;
  
  var

    i                              : integer; // Тип целое
    Rec_Color, Rec_Fill, Rec_Style : string;  // Тип строка
    Rec_C                          : Color;   // Тип цвет
    
  Begin
  
 // =====================================================================
 //                  Узнаем про линии и заливки прямоугольника
 // ---------------------------------------------------------------------    
 //                           Узнаем цвет линий
 // ---------------------------------------------------------------------
    writeln('Введите цвет линии прямоугольника (red,green,blue,black)');
    readln(Rec_Color);
    
 // --------------------------------------------------------------------- 
 //                    Узнаем и настраиваем стиль линии
 // --------------------------------------------------------------------- 
    writeln('Введите стиль линии прямоугольника (---, - -, . ., - ., -..)');
    readln(Rec_Style);
    
 // --------------------------------------------------------------------- 
 //                         Узнаем цвет заливки
 // --------------------------------------------------------------------- 
    writeln('Введите цвет заливки прямоугольника (red,green,blue,black)');
    readln(Rec_Fill);

 // =====================================================================
 //                  Настраиваем линии и заливки
 // ---------------------------------------------------------------------
 //                    Цвет линии
 // ---------------------------------------------------------------------
    if Rec_Color='red'   then SetPenColor(clRed);
    if Rec_Color='green' then SetPenColor(clGreen);
    if Rec_Color='blue'  then SetPenColor(clBlue);
    if Rec_Color='black' then SetPenColor(clBlack);
    
 // ---------------------------------------------------------------------
 //                    Стиль линии
 // ---------------------------------------------------------------------   
    if Rec_Style = '---' then SetPenStyle(psSolid);
    if Rec_Style = '- -' then SetPenStyle(psDash);
    if Rec_Style = '. .' then SetPenStyle(psDot);
    if Rec_Style = '- .' then SetPenStyle(psDashDot);
    if Rec_Style = '-..' then SetPenStyle(psDashDotDot);  
    
 // ---------------------------------------------------------------------
 //                    Цвет заливки
 // ---------------------------------------------------------------------       
    if Rec_Fill='red'   then SetBrushColor(clRed);
    if Rec_Fill='green' then SetBrushColor(clGreen);
    if Rec_Fill='blue'  then SetBrushColor(clBlue);
    if Rec_Fill='black' then SetBrushColor(clBlack);    

//======================================================================= 
//                  Фух теперь можно рисовать
//-----------------------------------------------------------------------
    rectangle (50,50,190,100);

    for i := 1 to 3 do writeln;              //  делаем место
    SetBrushColor(clWhite);                  //  исправляем фон

    
 // =====================================================================
 //                  Узнаем про линии и заливки круга
 // ---------------------------------------------------------------------    
 //                           Узнаем цвет линий
 // ---------------------------------------------------------------------
    writeln('Введите цвет линии круга (red,green,blue,black)');
    readln(Rec_Color);
    
 // --------------------------------------------------------------------- 
 //                    Узнаем и настраиваем стиль линии
 // --------------------------------------------------------------------- 
    writeln('Введите стиль линии круга (---, - -, . ., - ., -..)');
    readln(Rec_Style);
    
 // --------------------------------------------------------------------- 
 //                         Узнаем цвет заливки
 // --------------------------------------------------------------------- 
    writeln('Введите цвет заливки круга (red,green,blue,black)');
    readln(Rec_Fill);

 // =====================================================================
 //                  Настраиваем линии и заливки
 // ---------------------------------------------------------------------
 //                    Цвет линии
 // ---------------------------------------------------------------------
    if Rec_Color='red'   then SetPenColor(clRed);
    if Rec_Color='green' then SetPenColor(clGreen);
    if Rec_Color='blue'  then SetPenColor(clBlue);
    if Rec_Color='black' then SetPenColor(clBlack);
    
 // ---------------------------------------------------------------------
 //                    Стиль линии
 // ---------------------------------------------------------------------   
    if Rec_Style = '---' then SetPenStyle(psSolid);
    if Rec_Style = '- -' then SetPenStyle(psDash);
    if Rec_Style = '. .' then SetPenStyle(psDot);
    if Rec_Style = '- .' then SetPenStyle(psDashDot);
    if Rec_Style = '-..' then SetPenStyle(psDashDotDot);  
    
 // ---------------------------------------------------------------------
 //                    Цвет заливки
 // ---------------------------------------------------------------------       
    if Rec_Fill='red'   then SetBrushColor(clRed);
    if Rec_Fill='green' then SetBrushColor(clGreen);
    if Rec_Fill='blue'  then SetBrushColor(clBlue);
    if Rec_Fill='black' then SetBrushColor(clBlack);    

//======================================================================= 
//                  Фух теперь можно рисовать
//-----------------------------------------------------------------------
    circle (120,200,50); 
    for i := 1 to 7 do writeln;              //  делаем место
    SetBrushColor(clWhite);                  //  исправляем фон
    
 
 // =====================================================================
 //                  Узнаем про линии и заливки триугольника
 // ---------------------------------------------------------------------    
 //                           Узнаем цвет линий
 // ---------------------------------------------------------------------
    writeln('Введите цвет линии триугольника (red,green,blue,black)');
    readln(Rec_Color);
    
 // --------------------------------------------------------------------- 
 //                    Узнаем и настраиваем стиль линии
 // --------------------------------------------------------------------- 
    writeln('Введите стиль линии триугольника (---, - -, . ., - ., -..)');
    readln(Rec_Style);
    
 // --------------------------------------------------------------------- 
 //                         Узнаем цвет заливки
 // --------------------------------------------------------------------- 
    writeln('Введите цвет заливки триугольника (red,green,blue,black)');
    readln(Rec_Fill);

 // =====================================================================
 //                  Настраиваем линии и заливки
 // ---------------------------------------------------------------------
 //                    Цвет линии Rec_Color
 // ---------------------------------------------------------------------
    if Rec_Color='red'   then SetPenColor(clRed);
    if Rec_Color='green' then SetPenColor(clGreen);
    if Rec_Color='blue'  then SetPenColor(clBlue);
    if Rec_Color='black' then SetPenColor(clBlack);
    
 // ---------------------------------------------------------------------
 //                    Стиль линии
 // ---------------------------------------------------------------------   
    if Rec_Style = '---' then SetPenStyle(psSolid);
    if Rec_Style = '- -' then SetPenStyle(psDash);
    if Rec_Style = '. .' then SetPenStyle(psDot);
    if Rec_Style = '- .' then SetPenStyle(psDashDot);
    if Rec_Style = '-..' then SetPenStyle(psDashDotDot);  
    
 // ---------------------------------------------------------------------
 //                    Цвет заливки 
 // ---------------------------------------------------------------------       
    if Rec_Fill='red'   then Rec_C := clRed;
    if Rec_Fill='green' then Rec_C := clGreen;
    if Rec_Fill='blue'  then Rec_C := clBlue;
    if Rec_Fill='black' then Rec_C := clBlack;
    
//======================================================================= 
//                  Фух теперь можно рисовать
//-----------------------------------------------------------------------
    moveto (50,310);
    lineto (50,380);
    lineto (190,380);
    lineto (50,310);
    floodfill(60,370,Rec_C);
  
    

  End.
